Revit 2027 API
IndexLine Properties
The IndexLine type exposes the following members.
Properties
Name | Description
Index0 |  The index of the line segment's first vertex.
Index1 |  The index of the line segment's second vertex.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from IndexPrimitive)
Top
See Also
Reference
IndexLine Class
Autodesk.Revit.DB.DirectContext3D Namespace